import math
print("в дом работе казанно отправить код, вот вам и код")
"""
идут Бидуины по пустыне, дого идут
идут-идут от одного оазиса к другому 
видят сидит человек, а у него вместо головы огромная тыква
ну и они у него и спрашивают 
*слушай мужик, а как так получилось что ты сидишь тут один посреди бесскрайней пустини 
у тебя дорогой костюм, а в место головы у тебя огромная тыква*
и он им отвечает
*История моя долгая и сложная но я попробую её пересказать
видители я так же как и вы странствовал по пустыне, странствовал- странствовал долго 
скорее всего из тогоже оазиса что и вы, в тот же оазис в который вы направлялись и на пути
огибая одну из дюн, я обнаружил, торчащию из песка волшебную лампу, я поднял её, отряхнул от песка 
и оттуда вылез джжинн... и сказазл *ты освободил меня и я теперь исполню 3 любых твоих желания*
я конечно, немедленно пожелал что бы мне больше нехотелось пить, что бы мне не палило солнце, что бы я вообще был бессмертным.  
джиинн чёлкнул пальцами и тут же выполнил моё желание * кокого твоё второе желание?* -спросил джиин
Вторым желанием я попросил безграничные деньги на банковской карте или карманам, которые невозможно украсть
джинн немного подумал и всё же выполнил моё желание. . . да...вот так*
 Путишественники посмотрели на него... и спросили подожди, а как же третье желание?*
Незнакомец тяжело вдохнул и сказал, да... а вот с 3-им желанием действительно облажался...да*
*Так что же ты пожелал?*
-*Я пожелал что бы у меня вместо головы была огромная тыква*




"""
